<!DOCTYPE html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head><meta name="generator" content="Hexo 3.8.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
<meta name="theme-color" content="#222">









<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">
















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css">







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="/css/main.css?v=5.1.4" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="C++,Object Model,">










<meta name="description" content="前言 在C++中经常出现的问题就是求某个对象的大小，包括各种场景如空类，含虚函数的类，不含虚函数的类等等，与之相关的就是C++最重要的特性多态的实现方式——虚函数的内部实现机制。这些问题都涉及到C++的对象模型内存布局，下面就从计算对象空间大小问题引出对象内存的基本布局和对象模型的分类。并在接下来的各篇文章中依次介绍各个继承体系下对象内存布局情况大小，如未特殊说明这些实例均是在VS2015环境下测">
<meta name="keywords" content="C++,Object Model">

<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">EmptyClass ee[3];</span><br><span class="line">std::cout &lt;&lt; &quot;ee[0]:&quot; &lt;&lt; &amp;ee[0] &lt;&lt; &quot; ee[1]:&quot; &lt;&lt; &amp;ee[1] &lt;&lt; &quot; ee[2]:&quot; &lt;&lt; &amp;ee[2] &lt;&lt; std::endl;</span><br></pre></td></tr></table></figure>

<p>运行结果：</p>
<pre><code>ee[0]:00AFFBF0 ee[1]:00AFFBF1 ee[2]:00AFFBF2</code></pre><h3 id="一个正常类的对象大小"><a href="#一个正常类的对象大小" class="headerlink" title="一个正常类的对象大小"></a>一个正常类的对象大小</h3><hr>
<p>求如下类对象的大小：</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">class FullClass</span><br><span class="line">&#123;</span><br><span class="line">public:</span><br><span class="line">    FullClass()</span><br><span class="line">    &#123;&#125;</span><br><span class="line">public:</span><br><span class="line">    void Func1(void) // 普通成员函数</span><br><span class="line">    &#123;&#125;</span><br><span class="line">    static void Func2(void) // 静态成员函数</span><br><span class="line">    &#123;&#125;</span><br><span class="line">    virtual void Func3(void) // 虚成员函数</span><br><span class="line">    &#123;&#125;</span><br><span class="line">private:</span><br><span class="line">    int _var1;  // 普通成员变量</span><br><span class="line">    static int _var2; // 静态成员变量</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<p>测试：</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">void FullClassTest(void)</span><br><span class="line">&#123;</span><br><span class="line">    FullClass f;</span><br><span class="line">    std::cout &lt;&lt; &quot;Full class size is: &quot; &lt;&lt; sizeof(f) &lt;&lt; std::endl;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>

<p>运行结果：</p>
<pre><code>Full class size is: 8</code></pre><p>可以看到对象的大小为8，通过VS 查看内存布局的<code>cl</code>命令：</p>
<pre><code>cl inside_cpp_object_model.cpp /d1reportSingleClassLayoutFullClas</code></pre><blockquote>
<p><code>cl</code>命令查看内存布局的使用方式： <code>cl [filename] /d1reportSingleClassLayout[classname]</code></p>
</blockquote>
<p>可以看到<code>FullClass</code>的VS下的内存布局为：</p>
<pre><code>class FullClass size(16):
        +---
 0      | {vfptr}
 8      | _var1
        | &lt;alignment member&gt; (size=4)
        +---
FullClass::$vftable@:
        | &amp;FullClass_meta
        |  0
 0      | &amp;FullClass::Func3
FullClass::Func3 this adjustor: 0</code></pre><blockquote>
<p>即只有一个虚函数表的指针变量vfptr(指针类型(32位)占4 Bytes)和一个普通的成员变量_var1(int占4 Bytes)，其余的函数和变量不在对象的内存布局范围内<br>静态数据成员、静态成员函数和普通成员函数均不占对象内存空间</p>
</blockquote>
<h3 id="考虑字节对齐"><a href="#考虑字节对齐" class="headerlink" title="考虑字节对齐"></a>考虑字节对齐</h3><hr>
<p>在上述<code>FullClass</code>类中增加一个<code>char</code>类型普通变量:</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line">class FullClass</span><br><span class="line">&#123;</span><br><span class="line">public:</span><br><span class="line">    FullClass()</span><br><span class="line">    &#123;&#125;</span><br><span class="line">public:</span><br><span class="line">    void Func1(void) // 普通成员函数</span><br><span class="line">    &#123;&#125;</span><br><span class="line">    static void Func2(void) // 静态成员函数</span><br><span class="line">    &#123;&#125;</span><br><span class="line">    virtual void Func3(void) // 虚成员函数</span><br><span class="line">    &#123;&#125;</span><br><span class="line">private:</span><br><span class="line">    int _var1;  // 普通成员变量</span><br><span class="line">    static int _var2; // 静态成员变量</span><br><span class="line">    char _var3; // 增加的普通char类型变量，内存对齐</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<p>再次查看该类对象的大小：</p>
<pre><code>Full class size is: 12</code></pre><p>此时查看对象大小不是<code>8 + 1 = 9</code>，而是<code>8 + 4 = 12</code>，因为最后一个<code>char</code>有4字节对齐(32位按照int大小对齐，数据宽度32位，使总线的运输效率最大化)处理，增加了<code>padding</code>，通过VS <code>cl</code>命令的结果：</p>
<pre><code>class FullClass size(16):
        +---
 0      | {vfptr}
 8      | _var1
12      | _var3
        | &lt;alignment member&gt; (size=3)
        +---
FullClass::$vftable@:
        | &amp;FullClass_meta
        |  0
 0      | &amp;FullClass::Func3
FullClass::Func3 this adjustor: 0</code></pre><blockquote>
<p>使用<code>#pragma pack(1)</code>命令强制让其1字节对齐而不是默认的4字节对齐，从而结果为9 Bytes</p>
</blockquote>
<h3 id="对象大小总结"><a href="#对象大小总结" class="headerlink" title="对象大小总结"></a>对象大小总结</h3><hr>
<p>从上面的例子可以看出影响一个类对象的内存大小主要包括以下几个方面：</p>
<ol>
<li><strong>其非静态数据成员的总和大小</strong></li>
<li><strong>由于字节对齐而填补的空间大小</strong></li>
<li><strong>为了支持virtual而由内部产生的额外空间(包括虚函数表指针vfptr和虚拟继承表指针vbptr)</strong></li>
</ol>
<h2 id="对象模型种类"><a href="#对象模型种类" class="headerlink" title="对象模型种类"></a>对象模型种类</h2><hr>
<p>在C++中由两种类数据成员：static、nostatic；三种类成员函数：static、nostatic、virtual</p>
<blockquote>
<p>由于static不能修饰virtual，因为static属于类的而不是某个对象的，不存在this指针，而虚函数实现机制虚函数表需要this指针。所以此处的nostatic成员函数是指普通成员函数</p>
</blockquote>
<p>对于类中各种成员的布局，有以下三种模式：</p>
